jcwang4/ME461_Lab_Repo/ME461_FinalProject/workspace/quadStarter_f28027/quad_main.c
//#############################################################################
// FILE:   f28027_main.c
//
// TITLE:  Lab Starter
//#############################################################################

//
// Included Files
//
#include <stdio.h>
#include <stdlib.h>
#include <stdarg.h>
#include <string.h>
#include <math.h>
#include <limits.h>
#include "DSP28x_Project.h"
#include "f28027Serial.h"
#include "MadgwickAHRS.h"



#define PI          3.1415926535897932384626433832795
#define TWOPI       6.283185307179586476925286766559
#define HALFPI      1.5707963267948966192313216916398
//
// Function Prototypes
//
__interrupt void adc_isr(void);
__interrupt void cpu_timer0_isr(void);
__interrupt void cpu_timer1_isr(void);
__interrupt void cpu_timer2_isr(void);
__interrupt void SPI_RXint(void);
__interrupt void SWI_isr(void);

void setupSpia(void);        //for mpu9250
//void serialRXA(serial_t *s, char data);


int32_t numSWIcalls = 0;
uint16_t temp=0;
uint16_t XG_OFFSET_H        = 0x1300;
uint16_t XG_OFFSET_L        = 0x1400;
uint16_t YG_OFFSET_H        = 0x1500;
uint16_t YG_OFFSET_L        = 0x1600;
uint16_t ZG_OFFSET_H        = 0x1700;
uint16_t ZG_OFFSET_L        = 0x1800;

uint16_t SMPLRT_DIV         = 0x1900;

uint16_t CONFIG             = 0x1A00;
uint16_t GYRO_CONFIG        = 0x1B00;
uint16_t ACCEL_CONFIG       = 0x1C00;
uint16_t ACCEL_CONFIG_2     = 0x1D00;

uint16_t LP_ACCEL_ODR       = 0x1E00;
uint16_t WOM_THR            = 0x1F00;
uint16_t FIFO_EN            = 0x2300;

uint16_t I2C_MST_CTRL       = 0x2400;
uint16_t I2C_SLV0_ADDR      = 0x2500;
uint16_t I2C_SLV0_REG       = 0x2600;
uint16_t I2C_SLV0_CTRL      = 0x2700;
uint16_t I2C_SLV1_ADDR      = 0x2800;
uint16_t I2C_SLV1_REG       = 0x2900;
uint16_t I2C_SLV1_CTRL      = 0x2A00;

uint16_t INT_ENABLE         = 0x3800;
uint16_t INT_STATUS         = 0x3A00;

uint16_t I2C_SLV1_DO        = 0x6400;
uint16_t I2C_MST_DELAY_CTRL = 0x6700;

uint16_t USER_CTRL          = 0x6A00;
uint16_t PWR_MGMT_1         = 0x6B00;
uint16_t WHO_AM_I           = 0x7500;


//uint16_t XA_OFFSET_H        = 0x7700;
//uint16_t XA_OFFSET_L        = 0x7800;
//uint16_t YA_OFFSET_H        = 0x7A00;
//uint16_t YA_OFFSET_L        = 0x7B00;


// Offsets quad #1
//uint16_t XA_OFFSET_H        = 0x13;
//uint16_t XA_OFFSET_L        = 0x12;
//uint16_t YA_OFFSET_H        = 0xE6;
//uint16_t YA_OFFSET_L        = 0x18;


// Offsets quad #2
uint16_t XA_OFFSET_H        = 0x13;
uint16_t XA_OFFSET_L        = 0x12;
uint16_t YA_OFFSET_H        = 0xE6;
uint16_t YA_OFFSET_L        = 0x18;


uint16_t ZA_OFFSET_H        = 0x7D00;
uint16_t ZA_OFFSET_L        = 0x7E00;
uint16_t UARTPrint = 0;
int16_t Timer0Count = 0;
int16_t ADC0raw = 0;
int16_t ADC2raw = 0;
uint32_t ADCcount = 0;
int16_t readdata[4] = {0,0,0,0};
int16_t AccelXraw = 0;
int16_t AccelYraw = 0;
int16_t AccelZraw = 0;
float accelx = 0;
float accely = 0;
float accelz = 0;
int16_t gyroXraw = 0;
int16_t gyroYraw = 0;
int16_t gyroZraw = 0;
float gyrox  = 0;
float gyroy  = 0;
float gyroz  = 0;
float print_accelx = 0;
float print_accely = 0;
float print_accelz = 0;
float print_gyrox  = 0;
float print_gyroy  = 0;
float print_gyroz  = 0;

int16_t calibration_state = 0;
int32_t calibration_count = 0;
float accelx_offset=0;
float accely_offset=0;
float accelz_offset=0;
float gyrox_offset=0;
float gyroy_offset=0;
float gyroz_offset=0;
uint16_t SPIenc_state = 0;
int16_t SPI_Interrupt_Finished = 1;

float compass_angle = 0.0;

float max_mx = 66;
float min_mx = -26;
float max_my = 94 ;
float min_my = 2;
float max_mz = -3;
float min_mz = -117;

float mx_offset = 0;// (53 + -92)/2.0;//(53 + -92)/2.0; //(max_mx + min_mx)/2.0
float my_offset = 0;// (53 + -92)/2.0;//(73 + -86)/2.0; // (max_my + min_my)/2.0
float mz_offset = 0;//(53 + -92)/2.0; //(273 + 125)/2.0; // (max_mz + min_mz)/2.0

float mx = 0;
float my = 0;
float mz = 0;

// Variables related to Madgwick algorithm
float Quaternions[4];
float DotQuaternions[4];
float mdg_beta = 0.1;

extern float q0;
extern float q1;
extern float q2;
extern float q3;

float R11 = 0;
float R21 = 0;
float R31 = 0;
float R32 = 0;
float R33 = 0;

float mpu_roll = 0;
float mpu_pitch = 0;
float roll_tilt = 0;
float pitch_tilt = 0;
float yaw_tilt = 0;

float pitch_tiltrate = 0;
float roll_tiltrate = 0;
float yaw_tiltrate = 0;

int A1 = 0; //Top left propeller
int A2 = 0; //Bottom left propeller
int B1 = 0; //Top right propeller
int B2 = 0; // Bottom right propeller

float T_s = 0.005;
float integralThetaError = 0;
float integralThetaError_1 = 0;
float integralPhiError = 0;
float integralPhiError_1 = 0;

float tau_x = 0;
float tau_y = 0;
float tau_z = 0;
float F_z = 2300;

float Kp_y = 150;
float Ki_y = 0;
float Kd_y = 6.0;
float K_dd_y = 0.15;

float Kp_x = 150;
float Ki_x = 0.0;
float Kd_x = 6.0;
float K_dd_x = 0.15;

float Kp_z = 75;
float Ki_z = 0;
float Kd_z = 5.0;

//float thetaError = 0;
//float thetaError_1 = 0;
float w_x = 0;
float w_y = 0;
float w_z = 0;

float theta_est = 0;
float theta_est_1 = 0;
float theta_k = 0;
float theta_k_1 = 0;

float phi_est = 0;
float phi_est_1 = 0;
float phi_k = 0;
float phi_k_1 = 0;
float psi_est = 0;
float psi_est_1 = 0;
float psi_k = 0;
float psi_k_1 = 0;

float w_y_dot = 0;
float w_y_dot_1 = 0;
float w_y_1 = 0;

float w_x_dot = 0;
float w_x_dot_1 = 0;
float w_x_1 = 0;

float yawDif = 0;
float pitchDif = 0;

extern float pitchsetpoint;
extern float yawsetpoint;

//these are imported from MATLAB, LENGTH was changed for every iteration of the code, again used a different array name but not sure if this was necessary
float yk = 0;
#define LENGTH 5
float x[LENGTH]={0};
float m[LENGTH]={0};
float b[5]={    3.3833240118424500e-02, 2.4012702387971543e-01, 4.5207947200372001e-01, 2.4012702387971543e-01, 3.3833240118424500e-02}; // Matlab FIR low pass filter
float c[22]={   -2.3890045153263611e-03,    -3.3150057635348224e-03,    -4.6136191242627002e-03,    -4.1659855521681268e-03,    1.4477422497795286e-03, 1.5489414225159667e-02, 3.9247886844071371e-02, 7.0723964095458614e-02, 1.0453473887246176e-01, 1.3325672639406205e-01, 1.4978314227429904e-01, 1.4978314227429904e-01, 1.3325672639406205e-01, 1.0453473887246176e-01, 7.0723964095458614e-02, 3.9247886844071371e-02, 1.5489414225159667e-02, 1.4477422497795286e-03, -4.1659855521681268e-03,    -4.6136191242627002e-03,    -3.3150057635348224e-03,    -2.3890045153263611e-03};
float r[32]={   -1.6466950312719205e-03,    -1.9674478273332152e-03,    -2.5003674400324240e-03,    -2.9684278771570597e-03,    -2.8446917171801697e-03,    -1.4277801151067985e-03,    2.0225586357400412e-03, 8.1147975336387096e-03, 1.7155263118799242e-02, 2.9016348842214112e-02, 4.3076083572491840e-02, 5.8248706435185670e-02, 7.3107780287600024e-02, 8.6084070804293089e-02, 9.5704111083060386e-02, 1.0082568969505851e-01, 1.0082568969505851e-01, 9.5704111083060386e-02, 8.6084070804293089e-02, 7.3107780287600024e-02, 5.8248706435185670e-02, 4.3076083572491840e-02, 2.9016348842214112e-02, 1.7155263118799242e-02, 8.1147975336387096e-03, 2.0225586357400412e-03, -1.4277801151067985e-03,    -2.8446917171801697e-03,    -2.9684278771570597e-03,    -2.5003674400324240e-03,    -1.9674478273332152e-03,    -1.6466950312719205e-03};
float t[49]={   3.8168083579915922e-03, -3.4589333708678368e-03,    -6.9147551447963727e-03,    -1.3631840702259425e-04,    1.0188680261934764e-02, 7.6317848865174150e-03, -1.0000510607010774e-02,    -1.8517416378068072e-02,    1.4850797269400468e-03, 2.7051273313302662e-02, 1.6406730861711030e-02, -2.4772459719301049e-02,    -3.7527313932122899e-02,    6.5024645833607099e-03, 5.0126312962860256e-02, 2.4285061681454740e-02, -4.3316187535560775e-02,    -5.5017696936151023e-02,    1.4590312162091180e-02, 6.9780627184860167e-02, 2.6733509259813232e-02, -5.8307031134456164e-02,    -6.3049508354328390e-02,    2.2686450611081498e-02, 7.7463632124324944e-02, 2.2686450611081498e-02, -6.3049508354328390e-02,    -5.8307031134456164e-02,    2.6733509259813232e-02, 6.9780627184860167e-02, 1.4590312162091180e-02, -5.5017696936151023e-02,    -4.3316187535560775e-02,    2.4285061681454740e-02, 5.0126312962860256e-02, 6.5024645833607099e-03, -3.7527313932122899e-02,    -2.4772459719301049e-02,    1.6406730861711030e-02, 2.7051273313302662e-02, 1.4850797269400468e-03, -1.8517416378068072e-02,    -1.0000510607010774e-02,    7.6317848865174150e-03, 1.0188680261934764e-02, -1.3631840702259425e-04,    -6.9147551447963727e-03,    -3.4589333708678368e-03,    3.8168083579915922e-03};
//using MATLAB, we can define different cutoff frequencies and band frequencies. For the 31st order filter, it'll only pass values around 2000 Hz

//
// Main
//
void main(void)

{
    //
    // WARNING: Always ensure you call memcpy before running any functions from
    // RAM InitSysCtrl includes a call to a RAM based function and without a 
    // call to memcpy first, the processor will go "into the weeds"
    //
#ifdef _FLASH
    memcpy(&RamfuncsRunStart, &RamfuncsLoadStart, (size_t)&RamfuncsLoadSize);
#endif

    //
    // Initialize System Control:
    // PLL, WatchDog, enable Peripheral Clocks
    // This example function is found in the f2802x_SysCtrl.c file.
    //
    InitSysCtrl();

    //
    // Clear all interrupts and initialize PIE vector table:
    // Disable CPU interrupts
    //
    DINT;

    //
    // Initialize the PIE control registers to their default state.
    // The default state is all PIE interrupts disabled and flags
    // are cleared.
    // This function is found in the f2802x_PieCtrl.c file.
    //
    InitPieCtrl();

    //
    // Disable CPU interrupts and clear all CPU interrupt flags
    //
    IER = 0x0000;
    IFR = 0x0000;

    //
    // Initialize the PIE vector table with pointers to the shell Interrupt
    // Service Routines (ISR).
    // This will populate the entire table, even if the interrupt
    // is not used in this example.  This is useful for debug purposes.
    // The shell ISR routines are found in f2802x_DefaultIsr.c.
    // This function is found in f2802x_PieVect.c.
    //
    InitPieVectTable();

    //
    // Interrupts that are used in this example are re-mapped to
    // ISR functions found within this file.
    //
    EALLOW;            // This is needed to write to EALLOW protected registers
    PieVectTable.ADCINT1 = &adc_isr;
    PieVectTable.TINT0 = &cpu_timer0_isr;
    PieVectTable.TINT1 = &cpu_timer1_isr;
    PieVectTable.TINT2 = &cpu_timer2_isr;
    PieVectTable.SCIRXINTA = &RXAINT_recv_ready;
    PieVectTable.SCITXINTA = &TXAINT_data_sent;
    PieVectTable.SPIRXINTA = &SPI_RXint;
    PieVectTable.rsvd12_8 = &SWI_isr;
    EDIS;      // This is needed to disable write to EALLOW protected registers

    //
    // Step 4. Initialize the Device Peripheral. This function can be
    //         found in f2802x_CpuTimers.c
    //
    InitCpuTimers();        // For this example, only initialize the Cpu Timers


    //
    // Configure CPU-Timer 0, 1, and 2 to interrupt every second:
    // 60MHz CPU Freq, 1 second Period (in uSeconds)
    //
    ConfigCpuTimer(&CpuTimer0, 60, 100000);
    ConfigCpuTimer(&CpuTimer1, 60, 1000000);
    ConfigCpuTimer(&CpuTimer2, 60, 1000000);

    //
    // To ensure precise timing, use write-only instructions to write to the 
    // entire register. Therefore, if any of the configuration bits are changed
    // in ConfigCpuTimer and InitCpuTimers (in f2802x_CpuTimers.h), the
    // below settings must also be updated.
    //
    CpuTimer0Regs.TCR.all = 0x4001; //write-only instruction to set TSS bit = 0
    CpuTimer1Regs.TCR.all = 0x4001; //write-only instruction to set TSS bit = 0
    CpuTimer2Regs.TCR.all = 0x4001; //write-only instruction to set TSS bit = 0

    //
    // User specific code, enable interrupts
    //
    init_serial(&SerialA,115200);

    InitSpiGpio(); // Just Setup SPI pins
    setupSpia();
    InitAdc();
    InitAdcAio();

    //
    // Configure ADC
    EALLOW;
    AdcRegs.ADCCTL1.bit.INTPULSEPOS = 1;
    AdcRegs.INTSEL1N2.bit.INT1E     = 1;    // Enabled ADCINT1
    AdcRegs.INTSEL1N2.bit.INT1CONT  = 0;    // Disable ADCINT1 Continuous mode
    AdcRegs.INTSEL1N2.bit.INT1SEL   = 1;
    AdcRegs.ADCSOC0CTL.bit.CHSEL    = 0;
    AdcRegs.ADCSOC1CTL.bit.CHSEL    = 2;
    AdcRegs.ADCSOC0CTL.bit.TRIGSEL  = 0xB;  //EPWM4A
    AdcRegs.ADCSOC1CTL.bit.TRIGSEL  = 0xB;
    AdcRegs.ADCSOC0CTL.bit.ACQPS    = 40;
    AdcRegs.ADCSOC1CTL.bit.ACQPS    = 40;
    EDIS;


