jcwang4/ME461_Lab_Repo/ME461_FinalProject/workspace/quadStarter_f28027/quad_main.c
//    Use arctan to get compass angle if quadrotor flat
//    if(my < 0) {
//        compass_angle = 270.0-(((float)atan((mx/my)))*180.0/PI);
//    }
//    else if(my > 0) {
//        compass_angle = 90.0-(((float)atan((mx/my)))*180.0/PI);
//    }
//    else if((my == 0) && (mx < 0)) {
//        compass_angle = 180.0;
//    }
//    if((my == 0) && (mx > 0)) {
//        compass_angle = 0.0;
//    }

//    Use arctan to get compass angle if quadrotor flat
       if(my < 0) {
           compass_angle = 4.7124-(float)atan(mx/my);
       }
       else if(my > 0) {
           compass_angle = 1.571-(float)atan(mx/my);
       }
       else if((my == 0) && (mx < 0)) {
           compass_angle = PI;
       }
       if((my == 0) && (mx > 0)) {
           compass_angle = 0.0;
       }

     compass_angle = 0;

    SPIenc_state = 99;  // no state

    if(calibration_state == 0){
        calibration_count++;

        if (calibration_count == 400) {
            calibration_state = 1;
            calibration_count = 0;
        }
    } else if(calibration_state == 1){

        accelx_offset+=accelx;
        accely_offset+=accely;
        accelz_offset+=accelz;

        gyrox_offset+=gyrox;
        gyroy_offset+=gyroy;
        gyroz_offset+=gyroz;


        calibration_count++;
        if (calibration_count == 400) {
            calibration_state = 2;
            accelx_offset/=400.0;
            accely_offset/=400.0;
            accelz_offset/=400.0;
            gyrox_offset/=400.0;
            gyroy_offset/=400.0;
            gyroz_offset/=400.0;
            calibration_count = 0;
        }

    } else if(calibration_state == 2){
        accelx = accelx - (accelx_offset);
        accely = accely - (accely_offset);
        accelz = accelz - (accelz_offset)+1;
        print_accelx = accelx;
        print_accely = accely;
        print_accelz = accelz;
        gyrox  = gyrox - gyrox_offset;
        gyroy  = gyroy - gyroy_offset;
        gyroz  = gyroz - gyroz_offset;
        print_gyrox = gyrox;
        print_gyroy = gyroy;
        print_gyroz = gyroz;
//        mpu_roll = atan2(accely, accelz);
//        mpu_pitch = atan2(-accelx, sqrt(accely*accely + accelz*accelz) );

//        This is the Working Madgwick Algorithm -Ramya
        MadgwickAHRSupdateIMU(Quaternions, DotQuaternions, mdg_beta,
                              (PI/180.0)*gyrox,
                              (PI/180.0)*gyroy,
                              (PI/180.0)*gyroz,
                              accelx, accely, accelz);

        q0 = Quaternions[0];
        q1 = Quaternions[1];
        q2 = Quaternions[2];
        q3 = Quaternions[3];

        R11 = 2.0*q0*q0 -1 + 2.0*q1*q1;
        R21 = 2.0*(q1*q2 - q0*q3);
        R31 = 2.0*(q1*q3 + q0*q2);
        R32 = 2.0*(q2*q3 - q0*q1);
        R33 = 2.0*q0*q0 -1 + 2.0*q3*q3;


        //            Added - signs to angles
        roll_tilt =-1* atan2( R32, R33 );
        pitch_tilt = -1 * -atan( R31 / sqrt(1-R31*R31) );
//        yaw_tilt =-1 *  atan2( R21, R11 );

        //Measurements from gyroscope
        pitch_tiltrate = (gyroy*PI)/180.0; //z-axis: (gyroz*PI)/180.0; //y-axis: (gyroy*PI)/180.0; //x-axis: (gyrox*PI)/180.0; // rad/s
        roll_tiltrate = (gyrox*PI)/180.0; //z-axis: (gyroz*PI)/180.0; //y-axis: (gyroy*PI)/180.0; //x-axis: (gyrox*PI)/180.0; // rad/s
        yaw_tiltrate = (gyroz*PI)/180.0; //z-axis: (gyroz*PI)/180.0; //y-axis: (gyroy*PI)/180.0; //x-axis: (gyrox*PI)/180.0; // rad/s


        theta_est = -pitch_tilt;
        phi_est = -roll_tilt;
        psi_est = yaw_tilt;

        w_y = -pitch_tiltrate;
        w_x = -roll_tiltrate;
        w_z = yaw_tiltrate;

        w_y_dot = 0.6* w_y_dot_1 + 80 * w_y - 80*w_y_1;
        w_x_dot = 0.6* w_x_dot_1 + 80 * w_x - 80*w_x_1;

//        FT = 50;
//            f1_x = FT * sin(pitch_tilt);
////            f1_y = -FT *
//
////                    Motor commands A1, B1, A2, B2
//
//
//
//            k_F = 0;
//            k_M = 0;
////            length rotor to CoM (m)
//            l = 0.0916

//        w_y = -pitch_tiltrate;
//        w_x = - roll_tiltrate;
        w_z = yaw_tiltrate;
//
////        thetaError = -pitch_tilt;
//
//        theta_k = theta_k_1 + w_y * T_s;
//        phi_k = phi_k_1 + w_x * T_s;
        psi_k = psi_k_1 + w_z * T_s;
//
////        When accelx = 1, theta = 1.57 (pi/2)
////        theta_est = 0.9*(0.9*theta_k + 0.1* theta_k_1)+ 0.157 * accelx;
////        phi_est = 0.9*(0.9*phi_k + 0.1* phi_k_1)+ 0.157 * accely;
        psi_est = 0.9*(0.9*psi_k + 0.1* psi_k_1) + compass_angle*0.1;
//
//        theta_est = 0.999 * theta_k + .001 * accelx;

//        if((theta_est > PI / 2) || (theta_est < - PI / 2)){
//            integralThetaError = integralThetaError_1;
//        }
//        else{
//            integralThetaError = integralThetaError_1 + (theta_est + theta_est_1) / 2;
//        }

//        if((phi_est > PI / 2) || (phi_est < - PI / 2)){
//            integralPhiError = integralPhiError_1;
//        }
//        else{
//            integralPhiError = integralPhiError_1 + (phi_est + phi_est_1) / 2;
//        }

        integralPhiError = integralPhiError_1 + (phi_est + phi_est_1) / 2;

//        rollsetpoint = atan((abs(pinky-bluey))/(abs(pinkx-bluex)));

//        rollDif = phi_est - rollsetpoint;
        if(pitchsetpoint > 1.05)
        {
            pitchsetpoint = 1.05;
        }
        if(pitchsetpoint < -1.05)
        {
            pitchsetpoint = -1.05;
        }

        if(yawsetpoint > 1.05)
        {
            yawsetpoint = 1.05;
        }
        if(yawsetpoint < -1.05)
        {
            yawsetpoint = -1.05;
        }
//        if(fabs(yawsetpoint)>fabs(pitchsetpoint))
//        {
//            pitchsetpoint = 0;
//        }
//        if(fabs(yawsetpoint)<fabs(pitchsetpoint))
//        {
//            yawsetpoint = 0;
//        }
//
//        x[0] = pitchsetpoint; //initialize the array at the first ADC value
//        yk = 0;
//        int16_t j = 0; //initialize the starting point of the array
//
//        for(j = 0; j < LENGTH; j++) //for loop that will make an array of LENGTH, which is defined above
//        {
//
//            yk += b[j]*x[j]; //this mimics the commented out function below, where instead of individually multiplying it will
//            // multiply and add together to make the function
//        }
//
//        for(j=LENGTH-1; j > 0 ; j --)// then this function increments downwards
//        {
//            x[j] = x[j-1]; //this make it so that previous states are saved
//        }

        pitchDif = theta_est - pitchsetpoint;
        yawDif = psi_est - yawsetpoint;

