jcwang4/ME461_Lab_Repo/ME461_FinalProject/workspace/quadStarter_f28027/quad_main.c
        tau_x = -Kp_x * (phi_est) -Kd_x * (w_x) - K_dd_x * w_x_dot - Ki_x * integralPhiError;
        tau_y = -Kp_y * (pitchDif) -Kd_y * (w_y) - K_dd_y * w_y_dot - Ki_y * integralThetaError;
        tau_z = -Kp_z * (yawDif) -Kd_z * (w_z);


        A1 = tau_y*65  + tau_z *20 + F_z;
        A2 = -tau_y*65 + F_z + tau_z *20;
        B1 = tau_x * 65 + F_z - tau_z *20;
        B2 = -tau_x * 65 + F_z - tau_z *20;




//        A1 = tau_z *40;
//        A2 = tau_z *40;
//        B1 = -tau_z *40;
//        B2 = -tau_z *40;


        if(A1 > 3000){
            A1 = 3000;
        }
        else if(A1 <75){
            A1 = 75;
        }
        if(B1 > 3000){
            B1 = 3000;
        }
        else if(B1 <75){
            B1 = 75;
        }
        if(A2 > 3000){
            A2 = 3000;
        }
        else if(A2 <75){
            A2 = 75;
        }
        if(A2 > 3000){
            A2 = 3000;
        }
        if(B2 <75){
            B2 = 75;
        }
        else if(B2 > 3000){
            B2 = 3000;
        }

//        A1 = 0;
//        A2 = 0;
//        B1 = 0;
//        B2 = 0;
//        EPwm1Regs.CMPA.half.CMPA = A1;
//        EPwm1Regs.CMPB = B1;
//        EPwm2Regs.CMPA.half.CMPA = A2;
//        EPwm2Regs.CMPB = B2;

        EPwm1Regs.CMPA.half.CMPA = A1;
        EPwm2Regs.CMPB = A2;

        EPwm1Regs.CMPB = B1;
        EPwm2Regs.CMPA.half.CMPA = B2;


//        EPwm1Regs.CMPA.half.CMPA = 0;
//        EPwm1Regs.CMPB = 0;
//        EPwm2Regs.CMPA.half.CMPA = 0;
//        EPwm2Regs.CMPB = 0;

//        thetaError_1 = thetaError;
        theta_est_1 = theta_est;
        theta_k_1 = theta_k;
        phi_est_1 = phi_est;
        phi_k_1 = phi_k;
        psi_est_1 = psi_est;
        psi_k_1 = psi_k;

        w_y_dot_1 = w_y_dot;
        w_y_1 = w_y;
        w_x_dot_1 = w_x_dot;
        w_x_1 = w_x;

        integralPhiError_1 = integralPhiError;
        integralThetaError_1 = integralThetaError;

//        EPwm1Regs.CMPA.half.CMPA = A1;
//        EPwm1Regs.CMPB = B1;
//        EPwm2Regs.CMPA.half.CMPA = A2;
//        EPwm2Regs.CMPB = B2;
    }

    numSWIcalls++;

    GpioDataRegs.GPACLEAR.bit.GPIO5 = 1;
    DINT;

}

__interrupt void adc_isr(void)
{

//    GpioDataRegs.GPASET.bit.GPIO5 = 1;
    ADC0raw = AdcResult.ADCRESULT0;
    ADC2raw = AdcResult.ADCRESULT1;

    ADCcount++;
    if ((ADCcount%50)==0) {
        GpioDataRegs.GPBTOGGLE.bit.GPIO34 = 1;
    }

    if (SPI_Interrupt_Finished == 1) {
        SPI_Interrupt_Finished = 0;
        SpiaRegs.SPIFFRX.bit.RXFFIL = 4;

        GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;

        SpiaRegs.SPITXBUF = ((0x8000)|(0x3A00));
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;
        SPIenc_state = 4;
    }



    //
    // Clear ADCINT1 flag reinitialize for next SOC
    //
    AdcRegs.ADCINTFLGCLR.bit.ADCINT1 = 1;

    //
    // Acknowledge interrupt to PIE
    //
    PieCtrlRegs.PIEACK.all = PIEACK_GROUP1;

}




//
// cpu_timer0_isr -
//
__interrupt void cpu_timer0_isr(void)
{
    Timer0Count++;



    if (Timer0Count > 32000) { // Rolls over at 32767 so catch before that point
        Timer0Count = 0;
    }
   // GpioDataRegs.GPBTOGGLE.bit.GPIO34 = 1;
    if((Timer0Count % 3) == 0){
    UARTPrint = 1;
    }
    //
    // Acknowledge this interrupt to receive more interrupts from group 1
    //
    PieCtrlRegs.PIEACK.all = PIEACK_GROUP1;
}

//
// cpu_timer1_isr -
//
__interrupt void cpu_timer1_isr(void)
{
    CpuTimer1.InterruptCount++;

    //
    // The CPU acknowledges the interrupt
    //
    EDIS;
}

//
// cpu_timer2_isr -
//
__interrupt void cpu_timer2_isr(void)
{
    EALLOW;
    CpuTimer2.InterruptCount++;

    //
    // The CPU acknowledges the interrupt.
    //
    EDIS;
}

//// This function is called each time a char is recieved over UARTA.
//void serialRXA(serial_t *s, char data) {
//    numRXA ++;
//
//}

void SPI_RXint(void) {

    uint16_t i;

    switch (SPIenc_state) {
    case 4:
        GpioDataRegs.GPASET.bit.GPIO19 = 1;                 //Pull CS high as done R/W
        for (i=0; i<4; i++) {
            readdata[i] = SpiaRegs.SPIRXBUF; // readdata[0] is garbage
        }
        AccelXraw = readdata[1];
        AccelYraw = readdata[2];
        AccelZraw = readdata[3];

        SpiaRegs.SPIFFRX.bit.RXFFIL = 4;
        GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;

        SpiaRegs.SPITXBUF = ((0x8000)|(0x4200));
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;
        SPIenc_state = 5;
        break;
    case 5:
        GpioDataRegs.GPASET.bit.GPIO19 = 1;                 //Pull CS high as done R/W
        for (i=0; i<4; i++) {
            readdata[i] = SpiaRegs.SPIRXBUF; // readdata[0] is garbage
        }
        gyroXraw = readdata[1];
        gyroYraw = readdata[2];
        gyroZraw = readdata[3];

        SpiaRegs.SPIFFRX.bit.RXFFIL = 4;
        GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;

        SpiaRegs.SPITXBUF = ((0x8000)|(0x4A00));
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;

        SPIenc_state = 6;

        break;
    case 6:
        GpioDataRegs.GPASET.bit.GPIO19 = 1;                 //Pull CS high as done R/W
        for (i=0; i<4; i++) {
            readdata[i] = SpiaRegs.SPIRXBUF; // readdata[0] is garbage
        }
        mx = (float)readdata[1];
        my = (float)readdata[2];
        mz = (float)readdata[3];

        SPI_Interrupt_Finished = 1;
        PieCtrlRegs.PIEIFR12.bit.INTx8 = 1;
        break;

    }

    while(SpiaRegs.SPIFFRX.bit.RXFFST !=0){
        temp = SpiaRegs.SPIRXBUF;
    }

    SpiaRegs.SPIFFRX.bit.RXFFOVFCLR=1;  // Clear Overflow flag
    SpiaRegs.SPIFFRX.bit.RXFFINTCLR=1;  // Clear Interrupt flag

    PieCtrlRegs.PIEACK.all = PIEACK_GROUP6;   // Acknowledge interrupt to PIE

}



//
// End of File
//
void setupSpia(void)        //for mpu9250
{
    EALLOW;
    GpioCtrlRegs.GPAPUD.bit.GPIO16 = 0;    // Enable pull-up on GPIO16 (SIMO)
    GpioCtrlRegs.GPAMUX2.bit.GPIO16 = 1;   // Configure GPIO16 as SIMO

    GpioCtrlRegs.GPAPUD.bit.GPIO17 = 0;    // Enable pull-up on GPIO17 (SOMI)
    GpioCtrlRegs.GPAMUX2.bit.GPIO17 = 1;   // Configure GPIO17 as SOMI

    GpioCtrlRegs.GPAPUD.bit.GPIO18 = 0;    // Enable pull-up on GPIO18 (CLK)
    GpioCtrlRegs.GPAMUX2.bit.GPIO18 = 1;   // Configure GPIO18 as CLK

    GpioCtrlRegs.GPAMUX2.bit.GPIO19 = 0;
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    GpioCtrlRegs.GPADIR.bit.GPIO19 = 1;
    GpioCtrlRegs.GPAPUD.bit.GPIO19 = 1;

    EDIS;

    EALLOW;
    GpioCtrlRegs.GPAQSEL2.bit.GPIO16 = 3; // Set I/O pin to asynchronous mode recommended for SPI
    GpioCtrlRegs.GPAQSEL2.bit.GPIO17 = 3; // Set I/O pin to asynchronous mode recommended for SPI
    GpioCtrlRegs.GPAQSEL2.bit.GPIO18 = 3; // Set I/O pin to asynchronous mode recommended for SPI
    EDIS;

